(function(){
    indexdata = {
        // purchase
        purchase:{
            img:[
                "../images/index/purchase/purchase_goods1.jpg",
                "../images/index/purchase/purchase_goods2.jpg",
                "../images/index/purchase/purchase_goods3.jpg",
                "../images/index/purchase/purchase_goods4.jpg",
                "../images/index/purchase/purchase_goods1.jpg",
                "../images/index/purchase/purchase_goods2.jpg",
                "../images/index/purchase/purchase_goods3.jpg",
                "../images/index/purchase/purchase_goods4.jpg"
            ],
            title : [
                '红米5 2+16GB 移动4G+版 金色' ,
                '小米笔记本Pro 15 i7 16G' ,
                '米家行车记录仪 黑色',
                '小米笔记本Air 12.5" 4G 256G 银色' ,
                '红米5 2+16GB 移动4G+版 金色',
                '小米笔记本Pro 15 i7 16G',
                '米家行车记录仪 黑色' ,
                '小米笔记本Air 12.5" 4G 256G 银色'
            ],
            desc : [
                '轻薄长续航，金属机身' ,
                '轻薄长续航，金属机身' ,
                '轻薄长续航，金属机身' ,
                '轻薄长续航，金属机身' ,
                '轻薄长续航，金属机身' ,
                '轻薄长续航，金属机身' ,
                '轻薄长续航，金属机身' ,
                '轻薄长续航，金属机身'
            ],
            price : [
                '739元' , '739元' ,'1739元' , '1739元','739元' , '739元' ,'1739元' , '1739元'
            ],
            del : [
                '799元' , '799元' ,'1999元' , '1999元','799元' , '799元' ,'1999元' , '1999元'
            ]
        },
        // household
        household:{
            hot:{
                title:[
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸 "
                ],
                price:[
                    "999元","999元","999元","999元","999元","999元","999元","999元"
                ],
                comment:[
                    "人工智能 / 全高清屏幕 / 大内存","人工智能 / 全高清屏幕 / 大内存",
                    "人工智能 / 全高清屏幕 / 大内存","人工智能 / 全高清屏幕 / 大内存",
                    "人工智能 / 全高清屏幕 / 大内存","人工智能 / 全高清屏幕 / 大内存",
                    "人工智能 / 全高清屏幕 / 大内存"
                ]
            },
            ear:{
                title:[
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸 "
                ],
                price:[
                    "29元","79元","99元","149元","49元","29元","29元","29元"
                ],
                comment:[
                    "人工智能 / 全高清屏幕 / 大内存","人工智能 / 全高清屏幕 / 大内存",
                    "人工智能 / 全高清屏幕 / 大内存","人工智能 / 全高清屏幕 / 大内存",
                    "人工智能 / 全高清屏幕 / 大内存","人工智能 / 全高清屏幕 / 大内存",
                    "人工智能 / 全高清屏幕 / 大内存"
                ]
            },
            power:{
                title:[
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸 "
                ],
                price:["29元","79元","99元","149元","49元","29元","29元","29元"],
                comment:[
                    "人工智能 / 全高清屏幕 / 大内存","人工智能 / 全高清屏幕 / 大内存",
                    "人工智能 / 全高清屏幕 / 大内存","人工智能 / 全高清屏幕 / 大内存",
                    "人工智能 / 全高清屏幕 / 大内存","人工智能 / 全高清屏幕 / 大内存",
                    "人工智能 / 全高清屏幕 / 大内存"
                ]
            },
            card:{
                title:[
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸  ",
                    "  小米电视4C 43英寸 "
                ],
                price:["29元","79元","99元","149元","49元","29元","29元","29元"],
                comment:[
                    "人工智能 / 全高清屏幕 / 大内存","人工智能 / 全高清屏幕 / 大内存",
                    "人工智能 / 全高清屏幕 / 大内存","人工智能 / 全高清屏幕 / 大内存",
                    "人工智能 / 全高清屏幕 / 大内存","人工智能 / 全高清屏幕 / 大内存",
                    "人工智能 / 全高清屏幕 / 大内存"
                ]
            },
            length:4,
            attr:[
                "hot",
                "ear",
                "power",
                "card"
            ]
        }
        // smarty
        // smarty:{
        //     // 热门
        //     hot:{
        //         title:[
        //             "小米体重秤","小米体重秤","小米体重秤",
        //             "米家IH电饭煲 4L","米家IH电饭煲 4L","米家IH电饭煲 4L",
        //             "米家行车记录仪 ","米家行车记录仪 "
        //         ],
        //         price:[
        //             "999元","1999元","2999元","3999元","2999元","1999元","999元","10000元"
        //         ],
        //         comment:[
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式"
        //         ]
        //     },
        //     // 出行
        //     outdoor:{
        //         title:[
        //             "小米体重秤","小米体重秤","小米体重秤",
        //             "米家IH电饭煲 4L","米家IH电饭煲 4L","米家IH电饭煲 4L",
        //             "米家行车记录仪 ","米家行车记录仪 "
        //         ],
        //         price:[
        //             "999元","1999元","2999元","3999元","2999元","1999元","999元","10000元"
        //         ],
        //         comment:[
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式"
        //         ]
        //     },
        //     // 健康
        //     healthy:{
        //         title:[
        //             "小米体重秤","小米体重秤","小米体重秤",
        //             "米家IH电饭煲 4L","米家IH电饭煲 4L","米家IH电饭煲 4L",
        //             "米家行车记录仪 ","米家行车记录仪 "
        //         ],
        //         price:[
        //             "999元","1999元","2999元","3999元","2999元","1999元","999元","10000元"
        //         ],
        //         comment:[
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式"
        //         ]
        //     },
        //     // 酷玩
        //     play:{
        //         title:[
        //             "小米体重秤","小米体重秤","小米体重秤",
        //             "米家IH电饭煲 4L","米家IH电饭煲 4L","米家IH电饭煲 4L",
        //             "米家行车记录仪 ","米家行车记录仪 "
        //         ],
        //         price:[
        //             "999元","1999元","2999元","3999元","2999元","1999元","999元","10000元"
        //         ],
        //         comment:[
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式"
        //         ]
        //     },
        //     // 路由器
        //     router:{
        //         title:[
        //             "小米体重秤","小米体重秤","小米体重秤",
        //             "米家IH电饭煲 4L","米家IH电饭煲 4L","米家IH电饭煲 4L",
        //             "米家行车记录仪 ","米家行车记录仪 "
        //         ],
        //         price:[
        //             "999元","1999元","2999元","3999元","2999元","1999元","999元","10000元"
        //         ],
        //         comment:[
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式"
        //         ]
        //     }
        // }smarty:{
        //     // 热门
        //     hot:{
        //         title:[
        //             "小米体重秤","小米体重秤","小米体重秤",
        //             "米家IH电饭煲 4L","米家IH电饭煲 4L","米家IH电饭煲 4L",
        //             "米家行车记录仪 ","米家行车记录仪 "
        //         ],
        //         price:[
        //             "999元","1999元","2999元","3999元","2999元","1999元","999元","10000元"
        //         ],
        //         comment:[
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式"
        //         ]
        //     },
        //     // 出行
        //     outdoor:{
        //         title:[
        //             "小米体重秤","小米体重秤","小米体重秤",
        //             "米家IH电饭煲 4L","米家IH电饭煲 4L","米家IH电饭煲 4L",
        //             "米家行车记录仪 ","米家行车记录仪 "
        //         ],
        //         price:[
        //             "999元","1999元","2999元","3999元","2999元","1999元","999元","10000元"
        //         ],
        //         comment:[
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式"
        //         ]
        //     },
        //     // 健康
        //     healthy:{
        //         title:[
        //             "小米体重秤","小米体重秤","小米体重秤",
        //             "米家IH电饭煲 4L","米家IH电饭煲 4L","米家IH电饭煲 4L",
        //             "米家行车记录仪 ","米家行车记录仪 "
        //         ],
        //         price:[
        //             "999元","1999元","2999元","3999元","2999元","1999元","999元","10000元"
        //         ],
        //         comment:[
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式"
        //         ]
        //     },
        //     // 酷玩
        //     play:{
        //         title:[
        //             "小米体重秤","小米体重秤","小米体重秤",
        //             "米家IH电饭煲 4L","米家IH电饭煲 4L","米家IH电饭煲 4L",
        //             "米家行车记录仪 ","米家行车记录仪 "
        //         ],
        //         price:[
        //             "999元","1999元","2999元","3999元","2999元","1999元","999元","10000元"
        //         ],
        //         comment:[
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式"
        //         ]
        //     },
        //     // 路由器
        //     router:{
        //         title:[
        //             "小米体重秤","小米体重秤","小米体重秤",
        //             "米家IH电饭煲 4L","米家IH电饭煲 4L","米家IH电饭煲 4L",
        //             "米家行车记录仪 ","米家行车记录仪 "
        //         ],
        //         price:[
        //             "999元","1999元","2999元","3999元","2999元","1999元","999元","10000元"
        //         ],
        //         comment:[
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式","磁悬浮声波马达，定制多种刷牙模式",
        //             "磁悬浮声波马达，定制多种刷牙模式"
        //         ]
        //     }
        // }
    }
})();